//------------------------------------------------------------------------
// * @filename: Env.h
// *
// * @brief: 程序环境配置
// *
// * @author: XGM
// * @date: 2017/08/14
//------------------------------------------------------------------------
#pragma once

#include <memory>

namespace evpp {
	class SignalEventWatcher;
}

class Application;

class Env
{
public:
	Env(Application* pApp);
	~Env();

	//------------------------------------------------------------------------
	// 初始化运行环境
	//------------------------------------------------------------------------
	bool InitEnv(int argc, char** argv);

	//------------------------------------------------------------------------
	// 退出运行环境
	//------------------------------------------------------------------------
	void ExitEnv();

	//------------------------------------------------------------------------
	// 处理信号
	//------------------------------------------------------------------------
	void HandleSignal();

	//------------------------------------------------------------------------
	// 显示平均的时间消耗负载
	//------------------------------------------------------------------------
	void ShowLoadAverage(double frameElapsed, double frameInterval);

private:
	Application* m_pApp = nullptr;
	std::shared_ptr<evpp::SignalEventWatcher> m_pSignalEvent = nullptr;
};
